<!DOCTYPE html>

<html>

	<head>
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<meta name="description" content="tutoriale tic si info!">
		<meta name="keywords" content="info, tic, programare, informatica, tutoriale">
		<link rel="stylesheet" type="text/css" href="main2.css">
		<title>Info pentru toti</title>
	</head>
	
	<body>

<div class="paragraph">
<img src="androidvsios.jpg" style="width:100%"><br>
</div>
<h1 style="text-align:center">Android VS IOS</h1>
<div class="paragraph2">
<p>


Fiecare dintre noi are deja un telefon mobil. Unii au Samsung, al&#539;ii HTC, al&#539;ii Huawei, sau al&#539;ii iPhone. Unii dintre voi poate &#537;tia&#539;i, unii poate nu (mai exista cazuri izolate) ce sistem de operare ruleaz&#259; telefonul dumneavoastr&#259; inteligent. La fel ca un calculatoare, si smartphonurile au un sistem de operare, ce asigura leg&#259;tura dintre utilizator si ma&#537;in&#259;rie. Toate marcile de telefoane precizate anterior, mai pu&#539;in iPhone, Blackberry sau telefoanele Microsoft, ruleaz&#259; Android, in timp ce iPhone are IOS, Blackberry BlackberryOS si cele Microsoft, Windows Phone. 
<br>La nivel global, cele mai r&#259;sp&#515;ndite sisteme de operare de telefoane inteligente sunt Android si IOS, care sunt intr-un duel continuu de c&#515;t&#539;iva ani. Am&#515;ndou&#259; sunt la fel de bune, &#523;ns&#259; fiecare vine cu plusuri si minusuri. 
<br>Mai jos ave&#539;i cate o lista cu p&#259;reri in leg&#259;tura cu IOS si Android.
<br><br>
<u>Android</u>:<br>
- Fiind produs de Google, Android se sincronizeaz&#259; mai bine cu Gmail, Google Maps sau Google Calendar. Tot din acest motiv, update-urile ajung mai rapid pe Android dec&#515;t pe IOS.<br>
- La unele telefoane cu Android autonomia bateriei este mai mare, care ce-i drept, e data si de configura&#539;ia hardware a acesteia, in func&#539;ie de telefon.<br>
- Unele cu Android &#523;&#539;i permit sa adaugi card SD pentru memorie in plus. <br>
- cat despre customizare… Android permite instalarea de aplica&#539;ii cu care po&#539;i s&#259;-ti aranjezi ecranul &#523;n ce fel dore&#537;ti, in timp cu un iPhone nu po&#539;i face asta dec&#515;t f&#259;c&#515;nd un Jailbreak.<br>
- permite desc&#259;rcarea mai u&#537;oar&#259; a  fi&#537;ierelor torrent <br>
- in Play Store exist&#259; mai multe aplica&#539;ii gratuite dec&#515;t in App Store + posibilitatea de piratare a celor cu plat&#259;<br>
- setarea unui ringtone este mult mai u&#537;oar&#259;<br>
- introducerea unor melodii se poate face chiar gratis<br><Br>

<u>IOS</u>:<br>
- autonomia bateriei destul de mica<br>
- imposibilitatea ad&#259;ug&#259;rii cardurilor de memorie SD
<br>- customizarea se face prin jailbreak. Ca in App Store, &#523;n Cydia sunt multe prostii, &#523;ns&#259; sunt foarte multe tweakuri care se integreaz&#259; minunat cu sistemul de operare, iar orizontul de modificare este extrem de larg. Categoric mai larg dec&#515;t la Android. Si nu m&#259; refer la teme banale. M&#259; refer la tweakuri precum Auxo, Intelliscreen X, FlipControlCenter, Springtomize 3 &#537;i multe multe altele
<br>- unele aplica&#539;ii gratuite de pe Playstore devin cu plata &#523;n App Store sau invers (vezi jocul Pou)
<br>- f&#259;r&#259; fi&#537;iere de tip torrent<br>
- e mai greu s&#259; deschizi arhive<br>
- nu ai un manager de fi&#537;iere pentru a vizualiza con&#539;inutul din telefon
<br>- numai melodii cu plata (sau g&#259;se&#537;ti mai greu aplica&#539;ii cu muzica gratis, &#523;ns&#259; dac&#259; nu vrei ca dup&#259; fiecare resoftare s&#259; &#523;&#539;i cau&#539;i mereu si mereu sute de melodii, mai bine nu folose&#537;ti nicio aplica&#539;ie de genul)
<br>- nu &#523;&#539;i po&#539;i folosi propriul ringtone<br><br>

P&#259;rerea mea este ca mai bun este un telefon cu Android. Po&#539;i face mai multe, ai, cumva o libertate mai mare. Iar asta nu o zic pentru ca acum folosesc un telefon cu android, ci pentru ca am avut si &#523;nc&#259; am un alt telefon produs de marca Apple.



</p>

</div>
</body>
</html>

