<!DOCTYPE html>

<html>

	<head>
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<meta name="description" content="tutoriale tic si info!">
		<meta name="keywords" content="info, tic, programare, informatica, tutoriale">
		<link rel="stylesheet" type="text/css" href="main2.css">
		<title>Info pentru toti</title>
	</head>
	
	<body>

<div class="paragraph">
<img src="cydia.png" style="width:100%"><br>
</div>
<h1 style="text-align:center">Despre Cydia &#537;i Jailbreak</h1>
<div class="paragraph2">
<p>Poate pu&#539;ini dintre voi a&#539;i auzit de cuv&#515;ntul ”Jailbreak” &#537;i care e treaba cu el. Unii poate &#537;ti&#539;i sau a&#539;i auzit &#537;i a&#539;i accesa&#539;i aceast&#259; pagin&#259; pentru a vedea tutorialul. Oricum... Pentru ne&#537;tiutori ve&#539;i afla c&#515;teva informa&#539;ii despre jailbreak.<br><br><br>
<br><br>Jailbreak este un procedeu de instalare a programelor third-party pe iPhone, iPad &#537;i iPod Touch (adic&#259; acele aplica&#539;ii care nu au fost acceptate de Apple dintr-un motiv sau altul &#523;n App Store) prin intermediul aplica&#539;iei Cydia &#537;i de ridicare a orice restrici&#539;ii implementate de Apple pe acel produs.
Ce po&#539;i face cu Jailbeak? Te ajut&#259; s&#259; i&#539;i customizezi dispozitivul folosind diferite teme pentru desktop, pentru sistem, i&#539;i &#523;mbun&#259;t&#259;&#539;este interfa&#539;a, &#523;l face s&#259; mearg&#259; mai repede, &#523;l deblocheaz&#259; (dac&#259; telefonul este blocat pe o re&#539;ea). &#522;n acest articol v&#259; voi prezenta ce este jailbrak-ul.
<br><br><br>
Dic&#539;ionar Cydia: 
<br>1. Springboard=locul unde sunt aplica&#539;iile, un fel de desktop.
<br>2. Hard reset (reboot, reset) = presupune ap&#259;sarea butoanelor Home &#537;i Power, simultan, timp de 10 secunde, p&#515;na logo-ul Apple apare pe ecran. -> sistemul de operare se &#523;nchide brusc &#537;i booteaz&#259;/se porne&#537;te de la 0.
<br>3. Restart = presupune &#523;nchiderea de la butonul Power a iPhone-ului apoi repornirea lui tot de la acela&#537;i buton. -> sistemul de operare i&#537;i &#523;nchide toate procesele &#523;n mod corespunz&#259;tor apoi c&#515;nd &#523;l redeschizi booteaz&#259; de la 0.
<br>4. Respring = echivalentul unui soft reset, este necesar atunci c&#515;nd instalezi o tem&#259; sau o aplica&#539;ie simpl&#259;. -> nu &#523;nchide sistemul de operare ci doar „refreshuieste” sesiunea curent&#259;.
<br>5. Exit Safe Mode: a&#539;i observat c&#259; telefonul a f&#259;cut respring f&#259;r&#259; nicio comand&#259; de la dvs., pe bara de sus a telefonului/tabletei dvs. apare Exit Safe Mode &#523;n loc de ora &#537;i o aten&#539;ionare &#523;n limba englez&#259;? Asta &#523;nseamn&#259; c&#259; SpringBoard a c&#259;zut/a avut un crash &#537;i extensiile/temele au fost oprite/ascunse pentru o vreme. Pentru a ie&#537;i din asta pute&#539;i boota telefonul sau s&#259; intra&#539;i &#523;n Cydia, &#523;n rubrica ”Installed”, ”Recent” &#537;i dezinstala&#539;i aplica&#539;iile instalate recent. Crash-ul a vut loc din cauza unui virus, a unei suprainc&#259;rc&#259;ri sau a unei incoveniente a unor programe. 
<br><br><br>
&#536;i &#523;nc&#259; ceva... Dac&#259; ave&#539;i instalat&#259; deja Cydia dar mai aveti nevoie de ni&#537;te surse...
Pentru a instala programe, extensii, teme, tweak-uri (programe) din Cydia pe telefon/tablet&#259;, trebuie s&#259; instala&#539;i o serie de surse. Pentru a instala o surs&#259; trebuie parcur&#537;i urm&#259;torii pa&#537;i: <br>1) Intra&#539;i &#523;n Cydia, apoi &#523;n rubrica ”Sources”. Acolo ave&#539;i dou&#259;-trei surse preinstalate, dar nu sunt de ajuns. <br> 2) Ap&#259;sa&#539;i pe ”Edit” (dreapta sus), apoi pe ”Add” (st&#515;nga sus). <br>  3)in spa&#539;iul rezervat tasta&#539;i sursa apoi butonul ”Add source”.<br>
<br><br>Mai jos ave&#539;i lista cu sursele pentru Cydia.<br>
1)http://apt.thebigbos.org/repofiles/cydia/ <br>
2)http://repo.biteyourapple.net/ <br>
3)http://apt.saurik.com/ <br>
4)http://repo.cydiahacks.com/ <br>
5)http://repo.hackyouriphone.org/ <br>
6)http://repo.insanelyi.com/ <br>
7)http://apt.iphonemodding.com/ <br>
8)http://apt.modmyi.com/ <br>
9)http://repo666.utrasn0w.com/ <br>
10)http://sinfuliphonerepo.com/ <br>
11)http://apt.pwncenter.com/ <br>
12)http://cydia.xsellize.com/ <br>
13)http://cydia.zodttd.com/repo/cydia/ <br>
Voi veni curand si cu un tutorial de cum poti sa-ti faci jailbreak la iPhone :)
</p>

</div>

</div>
</body>
</html>

