<!DOCTYPE html>

<html>

	<head>
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<meta name="description" content="tutoriale tic si info!">
		<meta name="keywords" content="info, tic, programare, informatica, tutoriale">
		<link rel="stylesheet" type="text/css" href="main2.css">
		<title>Info pentru toti</title>
	</head>
	
	<body>

<div class="paragraph">
<img src="controlpanel.png" style="width:20%"><br>
</div>
<h1 style="text-align:center">Programs and Features. Indexing options. Default programs
<br>(Windows 7) (&#523;n rom&#515;n&#259;)
</h1>
<div class="paragraph2">
<p>
<i><b>Programs and Features</b></i> <br>
- Din „Progams and Features” pute&#539;i dezinstala din computer un program. Pe l&#515;ng&#259; aceasta pute&#539;i schimba, vizualiza &#537;i repara programe. <br>
- Aceast&#259; op&#539;iune poate fi dezactivat&#259; din „Windows Features”. <br>

<br><u>Dezinstalarea unui program:</u> Start -> Control Panel -> Programs -> Programs and Features  -> Click pe programul pe care dori&#539;i s&#259;-l dezinstala&#539;i -> Uninstall <br>

<b>OBS.:</b>  Op&#539;iunile pot fi Uninstall, Change, Uninstall/Change, Rapair sau Change/Repair <br>
<br>
<u>Schimbarea unui program: </u> <br>
- ajut&#259; la instalarea/dezinstalarea anumitor caracteristici ale unui program f&#259;r&#259; a-l dezinstala. <br>
- Nu toate programele au aceasta caracteristic&#259;. <br>
Start -> Control Panel -> Programs -> Programs and Features -> Click pe programul pe care dori&#539;i s&#259;-l dezinstala&#539;i -> Change <br> <br>

<u>Repararea unui program:</u> <br>
- pentru fi&#537;ierele corupte &#537;i set&#259;rile programului care au fost &#523;nlocuite cu cele originale din dosarul de instalare. <br>
- C&#515;teodat&#259; programul este doar reinstalat cu fi&#537;ierele componente suprascrise. <br>
- Nu toate programele au aceasta op&#539;iune. <br>
Start-> Control Panel -> Programs -> Programs and Features -> Click pe programul pe care dori&#539;i s&#259;-l dezinstala&#539;i -> Repair <br> <br>

<i><b>Indexing options</b></i> <br>
- Face parte din Windows 7 <br>
- Cu Windows 7 pute&#539;i face ca, c&#259;ut&#259;torul de indexuri  s&#259; v&#259; indexeze fi&#537;ierele dorite, ci &#537;i con&#539;inutul acestora. <br> <br>

Start -> scrie&#539;i &#523;n cutia de c&#259;utare ”Search”-> Indexing Options  <br> <br>

- &#523;n partea de sus ve&#539;i vedea num&#259;rul de obiect indexate, apoi mai jos o list&#259; cu loca&#539;iile care au fost incluse pe lista index&#259;rii. <br>

-<u> Ca s&#259; ad&#259;uga&#539;i o nou&#259; loca&#539;ie de indexare</u>, click pe „Modify”. Va ap&#259;rea orice drive este disponibil. Pute&#539;i bifa orice drive &#537;i dosar dori&#539;i s&#259; fie inclus pe index. C&#259;ut&#259;torului de indexuri i-ar putea lua ceva timp s&#259; adauge tot ce dori&#539;i s&#259; fie indexat. Dac&#259; a&#539;i observat c&#259; nu au fost indexate anumite fi&#537;iere din list&#259;, chiar dac&#259; le-a&#539;i selectat din list&#259;, atunci trebuie s&#259; ad&#259;uga&#539;i tipul fi&#537;ierului (extensia).  <br> <br>

- &#523;n „Index Setting” pute&#539;i alege s&#259; indexa&#539;i &#537;i fi&#537;iere criptate sau s&#259; modifica&#539;i diferite set&#259;ri ale indexului.  <br>
- Dac&#259; a&#539;i avut probleme cu indexul, &#523;l pute&#539;i reface/reconstrui f&#259;c&#515;nd click pe „Rebuild”. <br> <br>

<i><b>Default programs</b></i> <br>
- un program implicit e un program pe  care Windows &#523;l folose&#537;te pentru a deschide un tip particular de fi&#537;ier (de exemplu muzic&#259;, imagine, pagin&#259; web)(De exemplu: Dac&#259; ave&#539;i instalat mai mult de un browser pe calculator, pute&#539;i alege care dintre ele s&#259; fie cel implicit pentru deschiderea paginilor web. ) <br> <br> 

<u>Deschiderea „Default Programs”:</u> Start->Default Programs <br>
<i>Aici pute&#539;i:</i> <br>
1)s&#259; alege&#539;i programele implicite <br>
2)s&#259; asocia&#539;i un tip de fi&#537;ier unui program <br>
3) s&#259; schimba&#539;i set&#259;rile red&#259;rii automate <br>
4) s&#259; stabili&#539;i programelor implicite pentru calculator <br> <br>

1)<u>Alegerea programului implicit:</u> <br>
- aceast&#259; func&#539;ie este folosit&#259; pentru alegerea programelor pe care dori&#539;i s&#259; le folosi&#539;i in Windows &#523;n mod implicit.  <br> <br> 

2)<u>Asocierea unui tip de fi&#537;iere unui program:</u> <br>
- aceast&#259; func&#539;ie este folosit&#259; pentru alegerea unui program implicit pe baza tipului de fi&#537;ier sau de protocol. De exemplu: fi&#537;ierele de imagine cu extensia „.jpg” pot fi deschise cu un program, iar cele cu extenia „.bmp” cu un alt program. <br>
Start -> Default Programs -> „Asociate a file type or protocol with a program” -> Click pe tipul de fi&#537;ier/protocol pe care dori&#539;i ca un anumit program s&#259;-l deschid&#259; &#523;n mod implicit -> Change Program -> Alege&#539;i programul pe care dori&#539;i s&#259;-l folosi&#539;i pentru deschiderea fi&#537;ierului respectiv sau pe s&#259;geata de la „Other Programs” sau „Browse” pentru a g&#259;si programul dorit -> OK <br> <br>

3)<u>Modificarea set&#259;rilor de redare automat&#259;:</u> <br>
- aceast&#259; func&#539;ie este folosit&#259; pentru schimbarea programului pe care dori&#539;i s&#259;-l utiliza&#539;i pentru a porni diverse drivere, adic&#259; CD-uri, DVD-uri, USB-uri etc.  <br> <br> 

4)<u>Setarea programelor implicite:</u> <br>
- aceast&#259; func&#539;ie este folosit&#259; pentru navigarea pe internet &#537;i trimiterea de e-mail-uri. <br> <br> 


</p>

</div>

</body>
</html>

