<!DOCTYPE html>

<html>

	<head>
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<meta name="description" content="tutoriale tic si info!">
		<meta name="keywords" content="info, tic, programare, informatica, tutoriale">
		<link rel="stylesheet" type="text/css" href="main2.css">
		<title>Info pentru toti</title>
	</head>
	
	<body>

<div class="paragraph">
<img src="SO.jpg" style="width:100%"><br>
</div>
<h1 style="text-align:center">Cum instalezi un sistem de operare<br>(Windows 7)</h1>
<div class="paragraph2">
<p>Pe calculatorul meu am instalat, pentru prima dat&#259;, un Windows 7 Ultimate. De ce pentru prima dat&#259;? Pentru c&#259; p&#515;n&#259; acum, c&#515;nd am avut probleme cu PC-ul l-am dus la service, iar acum am vrut s&#259; &#523;ncerc cum e s&#259; fac acest lucru... &#523;nainte mi se p&#259;rea o chestie foarte complicat&#259;, care poate dura &#537;i jumat&#259;te de zi... Dar nu e a&#537;a. :) Am vazut-o pe pielea mea, iar eu v&#259; voi &#523;mp&#259;rt&#259;&#537;i ceea ce am f&#259;cut.
<br><br>De ce ai nevoie?
<br>-  sistem de operare
<br>- Stick USB sau CD/DVD

<br><img src="windowsisloadingfiles.png" style="float:right; width:34%; padding-right:120px">
<br>Mai &#523;nt&#515;i am creat un stick bootabil. Pentru aceasta<br>
        am cam umblat la BIOS. Pentru cei ce nu &#537;tiu, BIOS-ul<br>
        este un software de nivel sc&#259;zut, fiind primul program<br>
        ce ruleaz&#259; atunci c&#515;nd porni&#539;i calculatorul. Pentru a &#523;n&#539;elege<br>
        mai bine ce &#523;nseamn&#259; software de nivel sc&#259;zut, ar trebui s&#259; &#537;ti&#539;i<br>            
        ca programele instalate pe sistemul dvs, cum ar fi navigatorul<br>
        de Internet, programele de redare media sau programele din suita<br>
        Office sunt programe de nivel &#523;nalt, deoarece interac&#539;ioneaz&#259; cu<br>
        sistemul de operare. Sistemul de operare este un software de nivel<br>
        mediu, deoarece interac&#539;ioneaz&#259; cu resursele sistemului prin drivere<br>
        &#537;i prin BIOS. BIOS-ul este un software de nivel sc&#259;zut deoarece<br>
        controleaz&#259; &#523;n mod direct modul &#523;n care func&#539;ioneaz&#259; componentele calculatorului. <br>

<br><br><br><br> <img src="installwindows7.jpg" style="float:right; width:30%; padding-right:220px">
<br><br> Imediat cum porneste calculatorul, ap&#259;s&#259;m F2/F8/F11/F12/Del/Esc<br>
        ce tasta tb ap&#259;s&#259;t&#259; pentru BIOS sau pentru BOOT)-> "Boot" -> <br>
        "First boot device"/ "Boot device priority" sau &#523;n sec&#539;iunea BOOT<br>
        c&#259;uta&#539;i orice are leg&#259;tur&#259; cu dispozitivul de unde s&#259; se lansese<br>
        sistemul-> apare o list&#259; cu dispozitive pentru boot-are &#537;i se pune<br>
        CD-ROM, DVD-ROM sau USB pe primul loc, astfel &#523;nc&#515;t calculatorul<br>
        s&#259; porneasc&#259; de pe acel dispozitiv -> se salveaz&#259; modific&#259;rile<br>
        &#537;i se iese din BIOS. Astfel, se restaureaz&#259; calculatorul.

<br><br><br><br> <img src="langandtime.jpg" style="float:right; width:30%; padding-right:220px">
<br><br>Apoi, pentru cine nu are soft cu licen&#539;&#259;, poate crea stick-ul bootabil.<br>
        Intr-adev&#259;r, se poate crea &#537;i un CD/DVD bootabil, dar stick-ul este<br>
        mult mai avantajos deoarece nu te mai complici at&#515;t de mult c&#515;nd faci<br>
        acest lucru. &#522;nt&#515;i de toate c&#259;u&#539;i &#537;i desc&#259;rca&#539;i o imagine ISO care<br>
        con&#539;ine sistemul de operare dorit, &#523;n acest caz Windows 7,<br>
        Windows 8, Windows 10 etc. Apoi instala&#539;i Windows 7 USB DVD Download Tool<br>
        (care merge numai pentru Windows7 &#537;i care este un program care<br>
        este de la cei de la Microsoft &#537;i care v&#259; ajut&#259; s&#259; crea&#539;i un stick bootabil).<br>
       Windows 7 USB DVD Download Tool &#523;l pute&#539;i desc&#259;rca de <a href="http://wudt.codeplex.com/">aici</a>. 

<br><br><br><br><img src="getimportantupdates.jpg" style="float:right; width:30%; padding-right:240px"><br><br><br><br>Windows 7 USB DVD Download Tool este extrem de u&#537;or de folosit.<br>
        Trebuie s&#259; urma&#539;i patru pa&#537;i simpli, s&#259; ap&#259;sa&#539;i de c&#515;teva ori butonul ”Next”.<br>
        Primul pas, dup&#259; ce deschide&#539;i aplica&#539;ia, este alegerea imaginii<br>
        ISO a kit-ului de instalare. Trebuie doar s&#259; da&#539;i ”Browse” &#537;i<br>
        s&#259; selecta&#539;i fi&#537;ierul respectiv iar aceasta va ap&#259;rea &#523;n c&#515;mpul ”Source file”.<br><br><br><br> 
<br><br>
<img src="which.jpg" style="float:right; width:30%; padding-right:290px"><br><br><br><br><br><br><br>Al doilea pas este alegerea mediului pe care vor fi copiate<br>
        fi&#537;ierele necesare. Pute&#539;i alege &#523;ntre un stick USB &#537;i o unitate DVD.<br>
        Pentru stick USB, ap&#259;s&#259;&#539;i butonul ”USB device”. <br><br><br><br>
<br><br><img src="which.jpg" style="float:right; width:30%; padding-right:260px"><br><br><br>&#522;n pasul trei trebuie s&#259; select&#259;&#539;i din list&#259; stick-ul USB dorit.<br>
        &#522;n func&#539;ie de num&#259;rul de harddisk-uri, parti&#539;ii sau unit&#259;&#539;i optice,<br>
        acestea pot purta litera E sau F sau G etc. &#537;i apoi ap&#259;sa&#539;i butonul<br>
        ”Begin Copying”. Pasul patru const&#259; doar &#523;n indicatorul grafic care<br>
        va ar&#259;ta c&#515;t mai are p&#515;n&#259; termin&#259; de copiat fi&#537;ierele pe stick-ul USB.<br>
        Dup&#259; ce s-a finalizat implmentarea SO-ului pe USB sau DVD,<br>
        pute&#539;i &#523;ncerca instalarea sistemului pe calculator. <br><br><br>
<br><img src="where.jpg" style="float:right; width:30%; padding-right:320px"><br><br><br>    
        Av&#515;nd configura&#539;iile BIOS-ului setate pentru bootarea<br>
        de pe unitate de stocare extern&#259;, n-ar mai trebui dec&#515;t<br>
        s&#259; deschide&#539;i calculatorul, asigur&#515;ndu-v&#259; c&#259; ave&#539;i deja inserat <br>
        USB-ul, respective DVD-ul bootabil. <br><br><br><br><br>
<br><br><br><img src="setupisstartingservices.jpg" style="float:right; width:30%; padding-right:280px"><br><br>
        Va ap&#259;rea o interfa&#539;a dedicat&#259;, de unde pute&#539;i selecta limba,<br>
        timpul &#537;i metoda de introducere. Apoi, dup&#259; ce vom da “next”,<br> 
        vom da “install” -> bif&#259;m pentru acceptarea termenilor &#537;i condi&#539;ilor,<br>
        iar pentru o posibil&#259; formatare, vom da “Custom(advanced)”.<br>
        HDD-ul este o parte fizic&#259; a computerului ce stocheaz&#259; date,<br>
        iar pati&#539;ile divid drive-ul &#523;n mai multe par&#539;ii. Dac&#259; Hard discul<br>
        are data pe el, este recomandat s&#259; le &#537;terge&#539;i ori s&#259;-l formata&#539;i<br>
        (selecta&#539;i drive-ul din list&#259;, click pe “Drive options (advanced)”-> “Format”).<br>
        Dac&#259; PC-ul nu are parti&#539;ii &#523;nc&#259;, pute&#539;i crea una odat&#259; cu instalarea SO-ului<br>
        sau cu ajutorul unui program special. <br><br>
<br><br><br><img src="install-windows-copying-files.png" style="float:right; width:30%; padding-right:250px"><br><br>
        Dup&#259; cum spuneam, putem crea parti&#539;ii odat&#259; cu instalarea sistemului astfel:<br>
        Selecta&#539;i Hard Drive-ul din list&#259;, click “ Drive Options (advanced)”-><br>
        ->”New”-> selecta&#539;i m&#259;rimea &#537;i apoi “OK”. Apoi “Next” &#537;i se instaleaz&#259; sistemul.<br>
        Procesul va dura aproximativ o or&#259;. &#536;i dup&#259; ce s-a f&#259;cut instalarea &#537;i configurarea<br>
        datei, orei, loca&#539;iei, limbii etc., ca sistemul de calcul s&#259; func&#539;ioneze optim,<br>
        este recomandat s&#259; instala&#539;i driverele corespunz&#259;toare.<br>
        Driverul este un program care face leg&#259;tura &#523;ntre component hard &#537;i soft.<br>
        &#536;i de asemenea, s&#259; nu uit&#259;m nici de datele stocate. La instalare pute&#539;i<br>
        sau nu s&#259; formata&#539;i calculatorul, iar dac&#259; o face&#539;i, asigura&#539;i-v&#259; c&#259; a&#539;i<br>
        f&#259;cut &#537;i un back-up al datelor. <br><br>
<br><br>Cam asta e tot. Sper c&#259; v-am fost de ajutor. &#522;n partea lateral&#259;, ave&#539;i imagini cu instalarea pe pa&#537;i (primul sus, urm&#259;torul la urm&#259;torul paragraf etc.) cu instalarea sistemului, dup&#259; configura&#539;ia BIOS-ului &#537;i procurarea sistemului, respectiv crearea USB-ului bootabil.
</p>

</div>


</body>
</html>

