<!DOCTYPE html>

<html>

	<head>
		<meta name="viewport" content="width=device-width, initial-scale=1.0">
		<meta name="description" content="tutoriale tic si info!">
		<meta name="keywords" content="info, tic, programare, informatica, tutoriale">
		<link rel="stylesheet" type="text/css" href="main2.css">
		<title>Info pentru toti</title>
	</head>
	
	<body>

<div class="paragraph">
<img src="USB.jpg" style="width:100%"><br>
</div>
<h1>USB 3.1</h1>
<div class="paragraph2">
<p>&#522;n acest articol vreau s&#259; discut&#259;m despre noile tehnologii de pe pia&#539;&#259;. Voi &#523;ncerca s&#259; aduc &#523;n discu&#539;ie noul port USB despre care se tot vorbe&#537;te &#523;n perioada aceasta. Este vorba despre USB Type C.
<br><br>
<br>Ce este cu acest port USB? &#522;n mod normal el este o evolu&#539;ie a tehnologiei. Nu &#523;ntotdeauna ce este nou este &#537;i bun, dar de data asta aduce lucruri noi pe l&#515;ng&#259; el, aduce loc de disput&#259; &#523;ntre companii.
<br>USB Type C este schimbarea major&#259; din 2013 &#523;ncoace. Atunci s-a dezvoltat USB 3.1 &#537;i s-a dorit standardizarea &#537;i, totodat&#259;, uniformizarea acestei mufe. Avantajul noului port este ca nu te mai chinuie&#537;ti s&#259; introduci mufa pe partea corespunz&#259;toare.
<br>Dac&#259; avem telefoane sau dispozitive de ultima genera&#539;ie, chiar &#537;i laptopuri ieftine, avem de-a face cu noul USB. Era evident c&#259; Apple &#537;i MacBook-urile lor au deja astfel de dispozitiv. Am putea spune c&#259; au stat la baza dezvolt&#259;rii acestei tehnologii. &#522;n genera&#539;iile trecute, unul dintre cele mai rapide porturi era cel THUNDERBOLT 3, dezvoltat de c&#259;tre Apple.
<br>
<br>Un pic de istorie…
<br>&#522;n mod normal ar fi trebuit s&#259; &#523;ncep cu USB 1.0. Din p&#259;cate, el n-a fost niciodat&#259; lansat. Putem spune c&#259; a fost un prototip pentru USB 1.1.
<br>USB 1.1: 
<br>Vitezele erau n&#259;ucitoare pentru vremea aceea. Puteai s&#259; transferi p&#515;n&#259; la 12 Mbps &#537;i puteai transmite un maxim de 100 mA prin acel cablu.
<br>USB 2.0:
<br>&#522;nc&#259; &#523;l mai folosim &#523;n foarte multe locuri. Acesta a ajuns pe pia&#539;&#259; prin anii 2000 &#537;i a fost primit ca o mare realizare pentru vremea aceea. Puteai s&#259; transferi p&#515;na la 480Mbps, iar dac&#259; vorbim despre putere aveai de-a face cu un maxim de 1.8A la 2.5V.
<br>USB 3.0:
<br>A ap&#259;rut la sf&#515;r&#537;itul lui 2008. Din p&#259;cate nu prea s-a &#523;n&#539;eles cu Microsoft la vremea aceea. &#522;nc&#259; sunt multe buguri pe Windows 7 din cauza acestui tip de USB. &#522;ns&#259; noile tehnologii le-au &#523;nghi&#539;it &#537;i u&#537;or, u&#537;or vom renun&#539;a la el.
<br>E interesant faptul c&#259; oamenii &#523;nc&#259; se orienteaz&#259; spre pl&#259;ci de baz&#259; cu foarte multe USB 3.0, dar tehnologia trece spre un nou nivel.
<br>Ca performan&#539;e, &#537;i de data aceasta a fost foarte ok. Imagina&#539;i-v&#259; c&#259; un port USB 3.0 poate ajunge la viteze de p&#515;n&#259; la 5Gbps &#537;i s&#259; livreze 5V la 1.8A.
<br>USB 3.1:
<br>&#522;n 2013 tehnologia cerea ceva mai mult. A&#537;a c&#259; a ap&#259;rut USB 3.1. Acesta poate livra p&#515;n&#259; la 10 Gbps de informa&#539;ie &#537;i poate trimite 5V la 2A. Op&#539;ional poate livra de la 5A la 12V adic&#259; 60W sau 20V adic&#259; aproape 100W. Asta &#523;nseamn&#259; fericire pentru laptopurile high end. De exemplu, laptopurile Apple pot fi &#523;nc&#259;rcate cu USB. Pe l&#515;ng&#259; laptopuri gandi&#539;i-v&#259; la aceste laptopuri ultra sub&#539;iri, la cele conven&#539;ionale. Cu un astfel de port se poate incarca mult mai rapid bateria.
<br>
<br>Dar ce legatur&#259; au acestea cu USB Type A, USB Type B, USB Type C?
<br>Poate fi &#537;i o chestie de marketing sau poate fi o evolu&#539;ie a tehnologiei.
<br>Ca s&#259; v&#259; face&#539;i o idee spre aceste 3 porturi:
<br>-USB Type A – este portul clasic, cel rectangular pe care &#523;l stie toat&#259; lumea
<br>-USB Type B – este cel care este folosit la imprimante, scannere &#537;i a&#537;a mai departe
<br>-USB Type C – este cel pe care se pune accentul &#523;n momentul de fa&#539;&#259;. Probabil c&#259; va fi singurul port folosit &#523;n anii urm&#259;tori, cel pu&#539;in pe dispozitivele mobile.


</p>

</div>
</body>
</html>
